app/Filters/Adminauth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@edu-bmn.id'
AND `users`.`deleted_at` IS NULL
---
    public function before(RequestInterface $request, $arguments = null)
    {
        if (!$this->session->has('dbmn_user_session')) {
            return redirect()->to(HOST_URL . '/login');
        } else {
            if (!$user = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->find()) {