app/Controllers/Admin.php

SELECT *
FROM `users`
WHERE `email` = 'admin@akuonline.my.id'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    public function usermanagement()
    {
        $data['session'] = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->findAll();
        $data['users'] = $this->userModel->findAll();

SELECT *
FROM `users`
WHERE `email` = 'admin@edu-bmn.id'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `pdms`
WHERE `pdms`.`deleted_at` IS NULL
---
    public function pdmdata()
    {
        $data['session'] = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->findAll();
        $data['pdmdata'] = $this->pdmModel->findAll();

SELECT *
FROM `pdms`
WHERE `pdms`.`deleted_at` IS NULL
AND `pdms`.`id` = '5'
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '1'
---
    public function pdmdetail()
    {
        $id = $_POST['id'];

        $detail = $this->pdmModel->find($id);
        $editor = $this->userModel->find($detail['last_editor']);

SELECT *
FROM `users`
WHERE `email` = 'admin@edu-bmn.id'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `tnhs`
WHERE `tnhs`.`deleted_at` IS NULL
---
    public function tnhdata()
    {
        $data['session'] = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->findAll();
        $data['tnhdata'] = $this->tnhModel->findAll();

SELECT *
FROM `users`
WHERE `email` = 'admin@edu-bmn.id'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `gdbs`
WHERE `gdbs`.`deleted_at` IS NULL
---
    public function gdbdata()
    {
        $data['session'] = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->findAll();
        $data['gdbdata'] = $this->gdbModel->findAll();

SELECT *
FROM `users`
WHERE `email` = 'admin@edu-bmn.id'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `jijs`
WHERE `jijs`.`deleted_at` IS NULL
---
    public function jijdata()
    {
        $data['session'] = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->findAll();
        $data['jijdata'] = $this->jijModel->findAll();

SELECT *
FROM `users`
WHERE `email` = 'admin@edu-bmn.id'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `atls`
WHERE `atls`.`deleted_at` IS NULL
---
    public function atldata()
    {
        $data['session'] = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->findAll();
        $data['atldata'] = $this->atlModel->findAll();

SELECT *
FROM `users`
WHERE `email` = 'admin@edu-bmn.id'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `kdps`
WHERE `kdps`.`deleted_at` IS NULL
---
    public function kdpdata()
    {
        $data['session'] = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->findAll();
        $data['kdpdata'] = $this->kdpModel->findAll();