app/Controllers/Auth.php

    public function login()
    {

        if ($this->session->has('dbmn_user_session')) {
            $user = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->find();
---
SELECT *
FROM `users`
WHERE `email` = 'pdm@edu-bmn.id'
AND `users`.`deleted_at` IS NULL

    public function authenticate()
    {
        $email  = $_POST['email'];
        $password  = $_POST['password'];

        if ($user = $this->userModel->where('email', $email)->find()) {
---
SELECT *
FROM `users`
WHERE `email` = 'pdm@edu-bmn.id'
AND `users`.`deleted_at` IS NULL