app/Controllers/Pdm.php

    public function pdmdata()
    {
        $data['session'] = $this->userModel->where('email', $this->session->get('dbmn_user_session'))->find();
        $data['pdmdata'] = $this->pdmModel->findAll();
---
SELECT *
FROM `users`
WHERE `email` = 'pdm@edu-bmn.id'
AND `users`.`deleted_at` IS NULL
SELECT *
FROM `pdms`
WHERE `pdms`.`deleted_at` IS NULL